RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_lcdc_regs.h
/*
 * BEST (RW)
 *
 * Best BP_V values
 */
#define LCDC_CTRL_BP_V_RANGE_BEST_MASK (0x3FE00UL)
#define LCDC_CTRL_BP_V_RANGE_BEST_SHIFT (9U)
#define LCDC_CTRL_BP_V_RANGE_BEST_SET(x) (((uint32_t)(x) << LCDC_CTRL_BP_V_RANGE_BEST_SHIFT) & LCDC_CTRL_BP_V_RANGE_BEST_MASK)
#define LCDC_CTRL_BP_V_RANGE_BEST_GET(x) (((uint32_t)(x) & LCDC_CTRL_BP_V_RANGE_BEST_MASK) >> LCDC_CTRL_BP_V_RANGE_BEST_SHIFT)

/*
 * MIN (RW)
 *
 * Minimal BP_V values
 */
#define LCDC_CTRL_BP_V_RANGE_MIN_MASK (0x1FFU)
#define LCDC_CTRL_BP_V_RANGE_MIN_SHIFT (0U)
#define LCDC_CTRL_BP_V_RANGE_MIN_SET(x) (((uint32_t)(x) << LCDC_CTRL_BP_V_RANGE_MIN_SHIFT) & LCDC_CTRL_BP_V_RANGE_MIN_MASK)
#define LCDC_CTRL_BP_V_RANGE_MIN_GET(x) (((uint32_t)(x) & LCDC_CTRL_BP_V_RANGE_MIN_MASK) >> LCDC_CTRL_BP_V_RANGE_MIN_SHIFT)

/* Bitfield definition for register: CTRL_PW_V_RANGE */
/*
 * MAX (RW)
 *
 * Maximal PW_V values
 */
#define LCDC_CTRL_PW_V_RANGE_MAX_MASK (0x7FC0000UL)
#define LCDC_CTRL_PW_V_RANGE_MAX_SHIFT (18U)
#define LCDC_CTRL_PW_V_RANGE_MAX_SET(x) (((uint32_t)(x) << LCDC_CTRL_PW_V_RANGE_MAX_SHIFT) & LCDC_CTRL_PW_V_RANGE_MAX_MASK)
#define LCDC_CTRL_PW_V_RANGE_MAX_GET(x) (((uint32_t)(x) & LCDC_CTRL_PW_V_RANGE_MAX_MASK) >> LCDC_CTRL_PW_V_RANGE_MAX_SHIFT)

/*
 * BEST (RW)
 *
 * Best PW_V values
 */
#define LCDC_CTRL_PW_V_RANGE_BEST_MASK (0x3FE00UL)
#define LCDC_CTRL_PW_V_RANGE_BEST_SHIFT (9U)
#define LCDC_CTRL_PW_V_RANGE_BEST_SET(x) (((uint32_t)(x) << LCDC_CTRL_PW_V_RANGE_BEST_SHIFT) & LCDC_CTRL_PW_V_RANGE_BEST_MASK)
#define LCDC_CTRL_PW_V_RANGE_BEST_GET(x) (((uint32_t)(x) & LCDC_CTRL_PW_V_RANGE_BEST_MASK) >> LCDC_CTRL_PW_V_RANGE_BEST_SHIFT)

/*
 * MIN (RW)
 *
 * Minimal PW_V values
 */
#define LCDC_CTRL_PW_V_RANGE_MIN_MASK (0x1FFU)
#define LCDC_CTRL_PW_V_RANGE_MIN_SHIFT (0U)
#define LCDC_CTRL_PW_V_RANGE_MIN_SET(x) (((uint32_t)(x) << LCDC_CTRL_PW_V_RANGE_MIN_SHIFT) & LCDC_CTRL_PW_V_RANGE_MIN_MASK)
#define LCDC_CTRL_PW_V_RANGE_MIN_GET(x) (((uint32_t)(x) & LCDC_CTRL_PW_V_RANGE_MIN_MASK) >> LCDC_CTRL_PW_V_RANGE_MIN_SHIFT)

/* Bitfield definition for register: CTRL_FP_V_RANGE */
/*
 * MAX (RW)
 *
 * Maximal FP_V values
 */
#define LCDC_CTRL_FP_V_RANGE_MAX_MASK (0x7FC0000UL)
#define LCDC_CTRL_FP_V_RANGE_MAX_SHIFT (18U)
#define LCDC_CTRL_FP_V_RANGE_MAX_SET(x) (((uint32_t)(x) << LCDC_CTRL_FP_V_RANGE_MAX_SHIFT) & LCDC_CTRL_FP_V_RANGE_MAX_MASK)
#define LCDC_CTRL_FP_V_RANGE_MAX_GET(x) (((uint32_t)(x) & LCDC_CTRL_FP_V_RANGE_MAX_MASK) >> LCDC_CTRL_FP_V_RANGE_MAX_SHIFT)

/*
 * BEST (RW)
 *
 * Best FP_V values
 */
#define LCDC_CTRL_FP_V_RANGE_BEST_MASK (0x3FE00UL)
#define LCDC_CTRL_FP_V_RANGE_BEST_SHIFT (9U)
#define LCDC_CTRL_FP_V_RANGE_BEST_SET(x) (((uint32_t)(x) << LCDC_CTRL_FP_V_RANGE_BEST_SHIFT) & LCDC_CTRL_FP_V_RANGE_BEST_MASK)
#define LCDC_CTRL_FP_V_RANGE_BEST_GET(x) (((uint32_t)(x) & LCDC_CTRL_FP_V_RANGE_BEST_MASK) >> LCDC_CTRL_FP_V_RANGE_BEST_SHIFT)

/*
 * MIN (RW)
 *
 * Minimal FP_V values
 */
#define LCDC_CTRL_FP_V_RANGE_MIN_MASK (0x1FFU)
#define LCDC_CTRL_FP_V_RANGE_MIN_SHIFT (0U)
#define LCDC_CTRL_FP_V_RANGE_MIN_SET(x) (((uint32_t)(x) << LCDC_CTRL_FP_V_RANGE_MIN_SHIFT) & LCDC_CTRL_FP_V_RANGE_MIN_MASK)
#define LCDC_CTRL_FP_V_RANGE_MIN_GET(x) (((uint32_t)(x) & LCDC_CTRL_FP_V_RANGE_MIN_MASK) >> LCDC_CTRL_FP_V_RANGE_MIN_SHIFT)

/* Bitfield definition for register: CAM_SYNC_HCNT_MIN */
/*
 * VAL (RW)
 *
 * minimal acceptable HCNT Value
 */
#define LCDC_CAM_SYNC_HCNT_MIN_VAL_MASK (0xFFFFU)
#define LCDC_CAM_SYNC_HCNT_MIN_VAL_SHIFT (0U)
#define LCDC_CAM_SYNC_HCNT_MIN_VAL_SET(x) (((uint32_t)(x) << LCDC_CAM_SYNC_HCNT_MIN_VAL_SHIFT) & LCDC_CAM_SYNC_HCNT_MIN_VAL_MASK)
#define LCDC_CAM_SYNC_HCNT_MIN_VAL_GET(x) (((uint32_t)(x) & LCDC_CAM_SYNC_HCNT_MIN_VAL_MASK) >> LCDC_CAM_SYNC_HCNT_MIN_VAL_SHIFT)

/* Bitfield definition for register: CAM_SYNC_HCNT_BEST */
/*
 * HYST (RW)
 *
 * hysteresys of acceptable HCNT Value
 */
#define LCDC_CAM_SYNC_HCNT_BEST_HYST_MASK (0xFF0000UL)
#define LCDC_CAM_SYNC_HCNT_BEST_HYST_SHIFT (16U)
#define LCDC_CAM_SYNC_HCNT_BEST_HYST_SET(x) (((uint32_t)(x) << LCDC_CAM_SYNC_HCNT_BEST_HYST_SHIFT) & LCDC_CAM_SYNC_HCNT_BEST_HYST_MASK)
#define LCDC_CAM_SYNC_HCNT_BEST_HYST_GET(x) (((uint32_t)(x) & LCDC_CAM_SYNC_HCNT_BEST_HYST_MASK) >> LCDC_CAM_SYNC_HCNT_BEST_HYST_SHIFT)

/*
 * VAL (RW)
 *
 * best acceptable HCNT Value
 */
#define LCDC_CAM_SYNC_HCNT_BEST_VAL_MASK (0xFFFFU)
#define LCDC_CAM_SYNC_HCNT_BEST_VAL_SHIFT (0U)
#define LCDC_CAM_SYNC_HCNT_BEST_VAL_SET(x) (((uint32_t)(x) << LCDC_CAM_SYNC_HCNT_BEST_VAL_SHIFT) & LCDC_CAM_SYNC_HCNT_BEST_VAL_MASK)
#define LCDC_CAM_SYNC_HCNT_BEST_VAL_GET(x) (((uint32_t)(x) & LCDC_CAM_SYNC_HCNT_BEST_VAL_MASK) >> LCDC_CAM_SYNC_HCNT_BEST_VAL_SHIFT)

/* Bitfield definition for register: CAM_SYNC_HCNT_MAX */
/*
 * VAL (RW)
 *
 * maximal acceptable HCNT Value
 */
#define LCDC_CAM_SYNC_HCNT_MAX_VAL_MASK (0xFFFFU)
#define LCDC_CAM_SYNC_HCNT_MAX_VAL_SHIFT (0U)
#define LCDC_CAM_SYNC_HCNT_MAX_VAL_SET(x) (((uint32_t)(x) << LCDC_CAM_SYNC_HCNT_MAX_VAL_SHIFT) & LCDC_CAM_SYNC_HCNT_MAX_VAL_MASK)
#define LCDC_CAM_SYNC_HCNT_MAX_VAL_GET(x) (((uint32_t)(x) & LCDC_CAM_SYNC_HCNT_MAX_VAL_MASK) >> LCDC_CAM_SYNC_HCNT_MAX_VAL_SHIFT)

/* Bitfield definition for register: CAM_SYNC_HCNT_ST */
/*
 * VAL (RO)
 *
 * current HCNT value
 */
#define LCDC_CAM_SYNC_HCNT_ST_VAL_MASK (0xFFFFU)
#define LCDC_CAM_SYNC_HCNT_ST_VAL_SHIFT (0U)
#define LCDC_CAM_SYNC_HCNT_ST_VAL_GET(x) (((uint32_t)(x) & LCDC_CAM_SYNC_HCNT_ST_VAL_MASK) >> LCDC_CAM_SYNC_HCNT_ST_VAL_SHIFT)

/* Bitfield definition for register: SHADOW_DONE_ST */
/*
 * VAL (W1C)
 *
 * current shadow_done value for plane 7,...,0 respectively
 */
#define LCDC_SHADOW_DONE_ST_VAL_MASK (0xFFU)
#define LCDC_SHADOW_DONE_ST_VAL_SHIFT (0U)
#define LCDC_SHADOW_DONE_ST_VAL_SET(x) (((uint32_t)(x) << LCDC_SHADOW_DONE_ST_VAL_SHIFT) & LCDC_SHADOW_DONE_ST_VAL_MASK)
#define LCDC_SHADOW_DONE_ST_VAL_GET(x) (((uint32_t)(x) & LCDC_SHADOW_DONE_ST_VAL_MASK) >> LCDC_SHADOW_DONE_ST_VAL_SHIFT)

/* Bitfield definition for register: SHADOW_DONE_INT_EN */
/*
 * VAL (RW)
 *
 * shadow_done interrupt enable for plane 7,...,0 respectively
 */
#define LCDC_SHADOW_DONE_INT_EN_VAL_MASK (0xFFU)
#define LCDC_SHADOW_DONE_INT_EN_VAL_SHIFT (0U)
#define LCDC_SHADOW_DONE_INT_EN_VAL_SET(x) (((uint32_t)(x) << LCDC_SHADOW_DONE_INT_EN_VAL_SHIFT) & LCDC_SHADOW_DONE_INT_EN_VAL_MASK)
#define LCDC_SHADOW_DONE_INT_EN_VAL_GET(x) (((uint32_t)(x) & LCDC_SHADOW_DONE_INT_EN_VAL_MASK) >> LCDC_SHADOW_DONE_INT_EN_VAL_SHIFT)

